wip: iniciando 3 etapa de testes
